tests/performance/financial-api-stress.yml
# Specialized stress testing for financial APIs
# Focus on high-frequency data requests and concurrent users

config:
  target: "http://localhost:3000"
  phases:
    # Market opening simulation
    - duration: 300
      arrivalRate: 5
      rampTo: 200
      name: "Market opening surge"
    
    # Peak trading hours
    - duration: 900
      arrivalRate: 200
      name: "Peak trading simulation"
    
    # Market volatility spike
    - duration: 180
      arrivalRate: 500
      name: "High volatility period"
    
    # Normal trading
    - duration: 600
      arrivalRate: 100
      name: "Normal trading hours"
    
    # Market close
    - duration: 120
      arrivalRate: 5
      name: "Market close cooldown"

  plugins:
    expect: {}
    metrics-by-endpoint:
      useOnlyRequestNames: true

  variables:
    koreanStocks:
      - "005930.KS"  # Samsung Electronics
      - "000660.KS"  # SK Hynix
      - "035420.KS"  # NAVER
      - "207940.KS"  # Samsung Biologics
      - "006400.KS"  # Samsung SDI
      - "051910.KS"  # LG Chem
      - "028260.KS"  # Samsung C&T
      - "096770.KS"  # SK Innovation
      - "034730.KS"  # SK
      - "017670.KS"  # SK Telecom

    usstocks:
      - "AAPL"
      - "MSFT"
      - "GOOGL"
      - "AMZN"
      - "TSLA"
      - "NVDA"
      - "META"
      - "NFLX"

    currencies:
      - "USD"
      - "EUR"
      - "JPY"
      - "CNY"
      - "GBP"

scenarios:
  - name: "High-Frequency Korean Stock Data"
    weight: 40
    flow:
      # Rapid-fire Korean stock requests
      - loop:
          count: 5
          over: koreanStocks
          loopElement: stock
        flow:
          - get:
              url: "/api/financial/stocks?symbol={{ stock }}"
              headers:
                Cache-Control: "no-cache"
              expect:
                - statusCode: [200, 304]
                - contentType: "application/json"
              name: "korean_stock_request"
      
      # Batch Korean stocks request
      - get:
          url: "/api/financial/stocks?korean=true&limit=10"
          expect:
            - statusCode: 200
            - contentType: "application/json"
            - hasProperty: "stocks"
          name: "korean_batch_request"

  - name: "US Stock Market Data"
    weight: 25
    flow:
      # Popular US stocks
      - loop:
          count: 3
          over: usstocks
          loopElement: stock
        flow:
          - get:
              url: "/api/financial/stocks?symbol={{ stock }}"
              expect:
                - statusCode: [200, 304]
                - contentType: "application/json"
              name: "us_stock_request"

  - name: "Forex Rate Requests"
    weight: 20
    flow:
      # Major currency pairs with KRW
      - loop:
          count: 3
          over: currencies
          loopElement: currency
        flow:
          - get:
              url: "/api/financial/forex?from={{ currency }}&to=KRW"
              expect:
                - statusCode: [200, 304]
                - contentType: "application/json"
                - hasProperty: "rate"
              name: "forex_request"
      
      # Batch forex request
      - get:
          url: "/api/financial/forex?major=true"
          expect:
            - statusCode: 200
            - contentType: "application/json"
          name: "forex_batch_request"

  - name: "Portfolio Heavy Load"
    weight: 10
    flow:
      # Simultaneous portfolio operations
      - parallel:
          - get:
              url: "/api/portfolio"
              name: "portfolio_summary"
          - get:
              url: "/api/portfolio/performance?period=1M"
              name: "portfolio_performance"
          - get:
              url: "/api/portfolio/allocation"
              name: "portfolio_allocation"
          - get:
              url: "/api/transactions?limit=20"
              name: "recent_transactions"
      
      # Portfolio calculations under load
      - post:
          url: "/api/portfolio/calculate"
          json:
            includeRealTimeData: true
            includeProjections: true
          expect:
            - statusCode: [200, 202]
          name: "portfolio_calculation"

  - name: "Cache Stress Test"
    weight: 15
    flow:
      # Test cache performance with repeated requests
      - get:
          url: "/api/financial/stocks?symbol=005930.KS"
          name: "cache_test_1"
      - think: 1  # 1 second delay
      - get:
          url: "/api/financial/stocks?symbol=005930.KS"
          name: "cache_test_2"
      - think: 1
      - get:
          url: "/api/financial/stocks?symbol=005930.KS"
          name: "cache_test_3"
      
      # Bust cache and test performance
      - get:
          url: "/api/financial/stocks?symbol=005930.KS&nocache=true"
          name: "cache_bust_test"

  - name: "Real-time Data Simulation"
    weight: 25
    flow:
      # Simulate real-time data consumption patterns
      - loop:
          count: 10
        flow:
          - get:
              url: "/api/financial/stocks?symbol=005930.KS&realtime=true"
              name: "realtime_stock"
          - get:
              url: "/api/financial/forex?from=USD&to=KRW&realtime=true"
              name: "realtime_forex"
          - think: 2  # 2 second intervals (typical real-time update frequency)

  - name: "Market Data Dashboard Load"
    weight: 20
    flow:
      # Simulate dashboard loading all data at once
      - parallel:
          - get:
              url: "/api/financial/stocks?korean=true&limit=20"
              name: "dashboard_korean_stocks"
          - get:
              url: "/api/financial/stocks?us=true&limit=10"
              name: "dashboard_us_stocks"
          - get:
              url: "/api/financial/forex?major=true"
              name: "dashboard_forex"
          - get:
              url: "/api/financial/market-status"
              name: "dashboard_market_status"
          - get:
              url: "/api/portfolio/summary"
              name: "dashboard_portfolio"

# Performance expectations for financial APIs
expect:
  # Stock API performance
  - "http.response_time.korean_stock_request.p95": 500   # Korean stocks should be very fast (local cache)
  - "http.response_time.us_stock_request.p95": 1000      # US stocks allowed slightly higher latency
  - "http.response_time.forex_request.p95": 800          # Forex should be fast
  
  # Batch request performance
  - "http.response_time.korean_batch_request.p95": 1500  # Batch requests allowed more time
  - "http.response_time.forex_batch_request.p95": 1200
  
  # Portfolio operations
  - "http.response_time.portfolio_summary.p95": 2000     # Portfolio calculations can take longer
  - "http.response_time.portfolio_calculation.p95": 5000 # Complex calculations allowed 5s
  
  # Cache performance
  - "http.response_time.cache_test_2.p95": 100           # Cached requests should be very fast
  - "http.response_time.cache_test_3.p95": 100
  
  # Real-time data
  - "http.response_time.realtime_stock.p95": 300         # Real-time updates must be fast
  - "http.response_time.realtime_forex.p95": 300
  
  # Overall system performance
  - "http.request_rate": "> 150"                         # Should handle high request volume
  - "http.codes.200": "> 95%"                           # Very high success rate for financial data
  - "http.codes.500": "< 0.5%"                          # Minimal server errors tolerated
  - "http.codes.503": "< 0.1%"                          # Service unavailable should be rare